package main

import (
	"fmt"
)

/*
Дана последовательность температурных колебаний: -25.4, -27.0 13.0, 19.0, 15.5, 24.5, -21.0, 32.5.
Объединить данные значения в группы с шагом в 10 градусов. Последовательность в подмножноствах не важна.

Пример: -20:{-25.0, -27.0, -21.0}, 10:{13.0, 19.0, 15.5}, 20: {24.5}, etc.

*/

func task10() {
	fmt.Printf("\n ============ Task 10: ============ \n\n")

	// создание мапы для вывода и среза с данными
	temps := make(map[int]([]float32))
	given_vars := []float32{-25.4, -27.0, 13.0, 19.0, 15.5, 24.5, -21.0, 32.5}

	// перебор элементов среза и добавление значений в мапу
	for _, value := range given_vars {
		// int(value) / 10 * 10 - округление до ближайшего 10
		temps[int(value)/10*10] = append(temps[int(value)/10*10], value)
	}

	fmt.Printf("Temperatures: %v\n", temps)

	fmt.Printf("\n ================================= \n\n")
}
